STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.h
/* CAP Linkup State */
typedef uint8_t APP_CAP_Linkup_State_t;
#define APP_CAP_LINKUP_STATE_NONE               0x00
#define APP_CAP_LINKUP_STATE_STARTED_RESTORE    0x01
#define APP_CAP_LINKUP_STATE_STARTED_COMPLETE   0x02
#define APP_CAP_LINKUP_STATE_DONE_RESTORE       0x03
#define APP_CAP_LINKUP_STATE_DONE_COMPLETE      0x04

/* MCP Client Read State */
typedef uint8_t APP_MCP_Linkup_State_t;
#define APP_MCP_LINKUP_STATE_IDLE                        0x00
#define APP_MCP_LINKUP_STATE_CONFIGURE_TRACK_TITLE_NOTIF 0x01
#define APP_MCP_LINKUP_STATE_READ_MEDIA_STATE            0x02
#define APP_MCP_LINKUP_STATE_READ_TRACK_TITLE            0x03

typedef uint8_t APP_PASyncState_t;
#define APP_PA_SYNC_STATE_IDLE           (0x00)
#define APP_PA_SYNC_STATE_SYNCHRONIZING  (0x01)
#define APP_PA_SYNC_STATE_SYNCHRONIZED   (0x02)

typedef uint8_t APP_BIGSyncState_t;
#define APP_BIG_SYNC_STATE_IDLE          (0x00)
#define APP_BIG_SYNC_STATE_SYNCHRONIZING (0x01)
#define APP_BIG_SYNC_STATE_SYNCHRONIZED  (0x02)

typedef uint8_t APP_ScanState_t;
#define APP_SCAN_STATE_IDLE              (0x00)
#define APP_SCAN_STATE_SCANNING          (0x01)

/* MCP CLient Operation type*/
#define MCP_CLT_OP_CONFIGURE_TRACK_TITLE_NOTIFICATION           0x0001u
#define MCP_CLT_OP_MOVE_NEXT_TRACK                              0x0002u
#define MCP_CLT_OP_MOVE_PREVIOUS_TRACK                          0x0004u
#define MCP_CLT_OP_PLAY_TRACK                                   0x0008u
#define MCP_CLT_OP_PAUSE_TRACK                                  0x0010u
#define MCP_CLT_OP_READ_MEDIA_STATE                             0x0020u
#define MCP_CLT_OP_READ_TRACK_TITLE                             0x0040u
#define MCP_CLT_OP_ALL                                          0x007Fu

/* CCP Client Operation type*/
#define CCP_CLT_OP_READ_CALL_STATE                              0x0100u
#define CCP_CLT_OP_ANSWER_INC_CALL                              0x0200u
#define CCP_CLT_OP_TERMINATE_CALL                               0x0400u
#define CCP_CLT_OP_READ_FEATURES_STATUS                         0x0800u
#define CCP_CLT_OP_ALL                                          0x0F00u

typedef uint8_t APP_BroadcastMode_t;
#define APP_BROADCAST_MODE_NONE                                 (0x00)
#define APP_BROADCAST_MODE_SINK_ONLY                            (0x01)
#define APP_BROADCAST_MODE_SCAN_DELEGATOR                       (0x02)

/*Structure used for ASE information storage*/
typedef struct
{
  uint8_t               ID;
  ASE_State_t           state;
  ASE_Type_t            type;           /*Source of Sink*/
  uint8_t               allocated;
  uint8_t               num_channels;
  uint32_t              presentation_delay;
  uint32_t              controller_delay;
  Audio_Context_t       streaming_audio_context;
  uint8_t               enable_req;
}APP_ASE_Info_t;

typedef struct
{
  uint16_t              acl_conn_handle;
#if (APP_NUM_SNK_ASE > 0)
  APP_ASE_Info_t        aSnkASE[APP_NUM_SNK_ASE];
#endif /* (APP_NUM_SNK_ASE > 0) */
#if (APP_NUM_SRC_ASE > 0)
  APP_ASE_Info_t        aSrcASE[APP_NUM_SRC_ASE];
#endif /* (APP_NUM_SRC_ASE > 0) */
}APP_ASEs_t;

/*Structure used for connection information strorage*/
typedef struct
{
  uint16_t               Acl_Conn_Handle;
  uint8_t                Peer_Address_Type;
  uint8_t                Peer_Address[6];
  uint8_t                Role;
  audio_profile_t        AudioProfile;
  uint8_t                ConfirmIndicationRequired;
  uint8_t                ForceCompleteLinkup;
  uint8_t                LinkupRetry;
  APP_CAP_Linkup_State_t CAPLinkupState;
  uint8_t                GenericMediaPlayerCCID;
  MCP_MediaState_t       MediaState;
  uint8_t                PlayPauseOperation;
  APP_MCP_Linkup_State_t MCPLinkupState;
  uint8_t                GenericTelephoneBearerCCID;
  uint8_t                CurrentCallID;
  CCP_CallState_t        CurrentCallState;
  uint16_t               CurrentContentCtrlOp;
  uint16_t               PendingContentCtrlOp;
  APP_ASEs_t             *pASEs;
  Audio_Context_t        AvailableSnkAudioContext;
  Audio_Context_t        AvailableSrcAudioContext;
}APP_ACL_Conn_t;

#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
typedef struct
{
  BAP_BASE_Group_t              base_group;
  BAP_BASE_Subgroup_t           base_subgroups[2];
  BAP_BASE_BIS_t                base_bis[2];
  uint8_t                       codec_specific_config_bis[2][MAX_BSNK_BIS_CODEC_CONFIG_SIZE];
  uint8_t                       codec_specific_config_subgroup[2][MAX_BSNK_SUBGROUP_CODEC_CONFIG_SIZE];
  uint8_t                       RTN;
  uint16_t                      max_transport_latency;
  uint8_t                       subgroup_metadata[2][MAX_BSNK_METADATA_LEN];
  Target_Phy_t                  phy;
  uint8_t                       encryption;
  uint32_t                      broadcast_code[4u];
  uint8_t                       audio_driver_config;
  uint16_t                      current_BIS_conn_handles[APP_MAX_NUM_BIS];
  uint8_t                       current_num_bis;
  BAP_AudioCodecController_t    AudioCodecInController;
  BAP_SupportedStandardCodec_t  aStandardCodec[1];
  APP_PASyncState_t             PASyncState;
  APP_BIGSyncState_t            BIGSyncState;
  APP_ScanState_t               ScanState;
  uint8_t                       PASyncHandle;
  Audio_Location_t              Audio_Location;
  uint8_t                       sync_bis_index[APP_MAX_NUM_BIS];
  uint8_t                       num_sync_bis;
} APP_BNSK_Context_t;
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/

typedef struct
{
  BAP_Role_t                    bap_role;

  APP_ACL_Conn_t                ACL_Conn[CFG_BLE_NUM_LINK];

  uint8_t                       NumConn;

  uint8_t                       audio_driver_config;

  Audio_Role_t                  audio_role_setup;

  uint16_t                      cis_src_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_src;

