STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Peripheral/STM32_WPAN/App/tmap_app.h
  uint16_t                      cis_snk_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_snk;

  uint16_t                      cis_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_established;

  BAP_AudioCodecController_t    AudioCodecInController;

  BAP_SupportedStandardCodec_t  aStandardCodec[1];

  uint8_t                       NumSnkASEs;

  uint8_t                       NumSrcASEs;

  APP_ASEs_t                    aASEs[CFG_BLE_NUM_LINK];

  Audio_Location_t              SnkAudioLocations;

  Audio_Location_t              SrcAudioLocations;

  Audio_Context_t               SupportedSnkAudioContext;

  Audio_Context_t               SupportedSrcAudioContext;

  Audio_Context_t               AvailableSnkAudioContext;

  Audio_Context_t               AvailableSrcAudioContext;

  /* Codec Specific Capabilities for Sink Record */
#if (APP_NUM_SNK_PAC_RECORDS > 0)

  /* Handle of the Sink Audio Codec Record*/
  uint16_t                      aSnkPACRecordHandle[APP_NUM_SNK_PAC_RECORDS];

  /* Sink Published Audio Capabilities Records slots */
  BAP_AudioPACRecord_t          aSnkPACRecord[APP_NUM_SNK_PAC_RECORDS];

  /* Codec Specific Capabilities */
  uint8_t                       aSnkCap[APP_NUM_SNK_PAC_RECORDS][PACS_CODEC_SPECIFIC_CAPABILITIES_LENGTH];

  /* Metadata*/
  uint8_t                       aSnkMetadata[APP_NUM_SNK_PAC_RECORDS][PACS_SRV_METADATA_SIZE];

#endif /*(APP_NUM_SNK_PAC_RECORDS > 0)*/
  /*Codec Specific Capabilities for Source Record*/
#if (APP_NUM_SRC_PAC_RECORDS > 0)

  /*Handle of the Source PAC Record*/
  uint16_t                      aSrcPACRecordHandle[APP_NUM_SRC_PAC_RECORDS];

  /* Source Published Audio Capabilities Records slots*/
  BAP_AudioPACRecord_t          aSrcPACRecord[APP_NUM_SRC_PAC_RECORDS];

  /* Codec Specific Capabilities */
  uint8_t                       aSrcCap[APP_NUM_SRC_PAC_RECORDS][PACS_CODEC_SPECIFIC_CAPABILITIES_LENGTH];

  /* Metadata*/
  uint8_t                       aSrcMetadata[APP_NUM_SRC_PAC_RECORDS][PACS_SRV_METADATA_SIZE];

#endif /*(APP_NUM_SRC_PAC_RECORDS > 0)*/

  uint8_t                       NumOutputChannels;

#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT)
  uint8_t                       CSIPRank;
#endif /* (APP_CSIP_ROLE_SET_MEMBER_SUPPORT) */

  uint32_t                      Audio_Frequency;
#if ((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)
  APP_BNSK_Context_t            BSNK;
#endif /*((APP_TMAP_ROLE & TMAP_ROLE_BROADCAST_MEDIA_RECEIVER) == TMAP_ROLE_BROADCAST_MEDIA_RECEIVER)*/

  APP_BroadcastMode_t           BroadcastMode;

} TMAPAPP_Context_t;

typedef struct
{
  Supported_Sampling_Freq_t     Freq;
  Supported_Frame_Duration_t    FrameDuration;
  uint16_t                      MinOctetsPerCodecFrame;
  uint16_t                      MaxOctetsPerCodecFrame;

} APP_CodecCap_t;

typedef struct
{
  Sampling_Freq_t       freq;
  uint32_t              sdu_interval;
  BAP_Framing_t         framing;
  uint16_t              max_sdu;
  uint8_t               rtx_num;
  uint16_t              max_tp_latency;
  uint32_t              presentation_delay;

} APP_QoSConf_t;

typedef struct
{
  uint8_t       NumSnkASEs;
  uint8_t       NumSrcASEs;
  uint8_t       NumAudioChnlsPerSnkASE;
  uint8_t       MinSnkAudioLocations;
  uint8_t       NumAudioChnlsPerSrcASE;
  uint8_t       MinSrcAudioLocations;
  uint8_t       NumCISes;
  uint16_t      NumAudioStreams;

} APP_UnicastAudioConf_t;


/* External variables --------------------------------------------------------*/

/* Exported macros ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions ---------------------------------------------*/
tBleStatus APP_AUDIO_STACK_Init(void);
void TMAPAPP_Init(uint8_t csip_config_id);
tBleStatus TMAPAPP_Linkup(uint16_t ConnHandle);
uint8_t TMAPAPP_StartAdvertising(CAP_Announcement_t AnnouncementType,
                                 uint8_t EnableSolicitationRequest,
                                 uint16_t Appearance);
uint8_t TMAPAPP_StopAdvertising(void);
uint8_t TMAPAPP_VolumeUp(void);
uint8_t TMAPAPP_VolumeDown(void);
uint8_t TMAPAPP_ToggleMute(void);
tBleStatus TMAPAPP_NextTrack(void);
tBleStatus TMAPAPP_PreviousTrack(void);
tBleStatus TMAPAPP_PlayPause(void);
tBleStatus TMAPAPP_AnswerCall(void);
tBleStatus TMAPAPP_TerminateCall(void);
uint8_t TMAPAPP_Disconnect(void);
void TMAPAPP_AclConnected(uint16_t Conn_Handle,uint8_t Peer_Address_Type,uint8_t Peer_Address[6],uint8_t role);
void TMAPAPP_CISConnected(uint16_t Conn_Handle);
void TMAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason);
void TMAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle);
void TMAPAPP_BondLost(uint16_t Conn_Handle);
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)
tBleStatus CSIPAPP_RegisterCSIS(uint8_t instance_id,
                                uint8_t SIRK_OOB,
                                uint8_t SIRK_type,
                                uint8_t* SIRK,
                                uint8_t size,
                                uint8_t rank);
#endif /*APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)*/
uint8_t TMAPAPP_SyncToPA(uint8_t AdvSID, uint8_t *pAdvAddress, uint8_t AdvAddressType);
uint8_t TMAPAPP_StartSink(void);
uint8_t TMAPAPP_StopSink(void);
void TMAPAPP_SetBroadcastMode(APP_BroadcastMode_t mode);
void TMAPAPP_ClearDatabase(void);
#ifdef __cplusplus
}
#endif

#endif /*__TMAP_APP_H */
